org/groupcache.org
#+TITLE: groupcache源码阅读

* 前言
  groupcache是golang写的一个缓存库，因为是内存缓存，所以效率比较高。目前公司会用到，而且源码比较简单，所以饿着肚子通读了它的源码。
  groupcache大概可以分为三层结构（自己分的，大雾），每层提供基本的功能，下层为上层提供服务。
  第一层是lru包下的cache结构，这层提供了基本的cache功能，提供最近最少使用淘汰缓存数据。
  第二层是groupcache.go文件中的cache结构，它是对lru.cache的分装，并提供安全并发功能，合一些基本的统计数据。
  第三层是groupcache.go中的group结构, 它提供了简单的分布式缓存支持，flight缓存调用(对于并发的多次读取，只请求一次get，每个并发返回相同的数据)。
* lru.cache结构
  lru下的cache结构，数据存放在一个双向链表中，并提供一个map映射到key跟列表的元素，链表主要提供lru算法。map主要提供快速查找key。如下图所示, list是标准库中的container/list
  #+BEGIN_SRC go
    // Cache is an LRU cache. It is not safe for concurrent access.
    type Cache struct {
      // MaxEntries is the maximum number of cache entries before
      // an item is evicted. Zero means no limit.
      MaxEntries int

      // OnEvicted optionally specificies a callback function to be
      // executed when an entry is purged from the cache.
      OnEvicted func(key Key, value interface{})

      ll    *list.List
      cache map[interface{}]*list.Element
    }


    // Add adds a value to the cache.
    func (c *Cache) Add(key Key, value interface{}) {
      if c.cache == nil {
        c.cache = make(map[interface{}]*list.Element)
        c.ll = list.New()
      }
      if ee, ok := c.cache[key]; ok {
        //如果拿到key的数据，是热点数据，放在链表最前面,并更新值
        c.ll.MoveToFront(ee)
        ee.Value.(*entry).value = value
        return
      }
      //没有则存放在list中，并对map建立索引
      ele := c.ll.PushFront(&entry{key, value})
      c.cache[key] = ele
      if c.MaxEntries != 0 && c.ll.Len() > c.MaxEntries {
        c.RemoveOldest()
      }
    }

    // Get looks up a key's value from the cache.
    func (c *Cache) Get(key Key) (value interface{}, ok bool) {
      if c.cache == nil {
        return
      }
      if ele, hit := c.cache[key]; hit {
        //如果能拿到，则是热点数据，移动到最前面。
        c.ll.MoveToFront(ele)
        return ele.Value.(*entry).value, true
      }
      return
    }
  #+END_SRC
   其他的一些操作都非常简单，不一一列出.
