groupcache.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-10 Sat 13:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>groupcache源码阅读</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">groupcache源码阅读</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7dbe2e4">1. 前言</a></li>
<li><a href="#org80bbd9d">2. lru.cache结构</a></li>
<li><a href="#org86e0567">3. cache结构</a></li>
<li><a href="#org7146199">4. group结构</a></li>
<li><a href="#orgfa48ad7">5. 分布式结构</a></li>
<li><a href="#org99cf417">6. 总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7dbe2e4" class="outline-2">
<h2 id="org7dbe2e4"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
groupcache是golang写的一个缓存库，因为是内存缓存，所以效率比较高。目前公司会用到，而且源码比较简单，所以饿着肚子通读了它的源码。
groupcache大概可以分为三层结构（自己分的，大雾），每层提供基本的功能，下层为上层提供服务。
第一层是lru包下的cache结构，这层提供了基本的cache功能，提供最近最少使用淘汰缓存数据。
第二层是groupcache.go文件中的cache结构，它是对lru.cache的分装，并提供安全并发功能，合一些基本的统计数据。
第三层是groupcache.go中的group结构, 它提供了简单的分布式缓存支持，flight缓存调用(对于并发的多次读取，只请求一次get，每个并发返回相同的数据)。
</p>
</div>
</div>
<div id="outline-container-org80bbd9d" class="outline-2">
<h2 id="org80bbd9d"><span class="section-number-2">2</span> lru.cache结构</h2>
<div class="outline-text-2" id="text-2">
<p>
lru下的cache结构，数据存放在一个双向链表中，并提供一个map映射到key跟列表的元素，链表主要提供lru算法。map主要提供快速查找key。如下图所示, list是标准库中的container/list
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Cache is an LRU cache. It is not safe for concurrent access.</span>
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Cache</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">MaxEntries is the maximum number of cache entries before</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">an item is evicted. Zero means no limit.</span>
  MaxEntries int

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">OnEvicted optionally specificies a callback function to be</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">executed when an entry is purged from the cache.</span>
  OnEvicted <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #bc6ec5;">(</span>key <span style="color: #ce537a; font-weight: bold;">Key</span>, value <span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #2d9574;">{}</span><span style="color: #bc6ec5;">)</span>

  ll    *list.List
  cache <span style="color: #4f97d7; font-weight: bold;">map</span><span style="color: #bc6ec5;">[</span><span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #2d9574;">{}</span><span style="color: #bc6ec5;">]</span>*<span style="color: #ce537a; font-weight: bold;">list.Element</span>
<span style="color: #4f97d7;">}</span>


<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Add adds a value to the cache.</span>
<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>c *<span style="color: #ce537a; font-weight: bold;">Cache</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #4f97d7;">(</span>key <span style="color: #ce537a; font-weight: bold;">Key</span>, value <span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #bc6ec5;">{}</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> c.cache == <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    c.cache = <span style="color: #4f97d7;">make</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">map</span><span style="color: #67b11d;">[</span><span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #b1951d;">{}</span><span style="color: #67b11d;">]</span>*<span style="color: #ce537a; font-weight: bold;">list.Element</span><span style="color: #2d9574;">)</span>
    c.ll = list.<span style="color: #bc6ec5; font-weight: bold;">New</span><span style="color: #2d9574;">()</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> ee, ok := c.cache<span style="color: #bc6ec5;">[</span>key<span style="color: #bc6ec5;">]</span>; ok <span style="color: #bc6ec5;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#25343;&#21040;key&#30340;&#25968;&#25454;&#65292;&#26159;&#28909;&#28857;&#25968;&#25454;&#65292;&#25918;&#22312;&#38142;&#34920;&#26368;&#21069;&#38754;,&#24182;&#26356;&#26032;&#20540;</span>
    c.ll.<span style="color: #bc6ec5; font-weight: bold;">MoveToFront</span><span style="color: #2d9574;">(</span>ee<span style="color: #2d9574;">)</span>
    ee.Value.<span style="color: #2d9574;">(</span>*<span style="color: #ce537a; font-weight: bold;">entry</span><span style="color: #2d9574;">)</span>.value = value
    <span style="color: #4f97d7; font-weight: bold;">return</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#27809;&#26377;&#21017;&#23384;&#25918;&#22312;list&#20013;&#65292;&#24182;&#23545;map&#24314;&#31435;&#32034;&#24341;</span>
  ele := c.ll.<span style="color: #bc6ec5; font-weight: bold;">PushFront</span><span style="color: #bc6ec5;">(</span>&amp;<span style="color: #ce537a; font-weight: bold;">entry</span><span style="color: #2d9574;">{</span>key, value<span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span>
  c.cache<span style="color: #bc6ec5;">[</span>key<span style="color: #bc6ec5;">]</span> = ele
  <span style="color: #4f97d7; font-weight: bold;">if</span> c.MaxEntries != <span style="color: #a45bad;">0</span> &amp;&amp; c.ll.<span style="color: #bc6ec5; font-weight: bold;">Len</span><span style="color: #bc6ec5;">()</span> &gt; c.MaxEntries <span style="color: #bc6ec5;">{</span>
    c.<span style="color: #bc6ec5; font-weight: bold;">RemoveOldest</span><span style="color: #2d9574;">()</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Get looks up a key's value from the cache.</span>
<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>c *<span style="color: #ce537a; font-weight: bold;">Cache</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">Get</span><span style="color: #4f97d7;">(</span>key <span style="color: #ce537a; font-weight: bold;">Key</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>value <span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #bc6ec5;">{}</span>, ok <span style="color: #ce537a; font-weight: bold;">bool</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> c.cache == <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> ele, hit := c.cache<span style="color: #bc6ec5;">[</span>key<span style="color: #bc6ec5;">]</span>; hit <span style="color: #bc6ec5;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#33021;&#25343;&#21040;&#65292;&#21017;&#26159;&#28909;&#28857;&#25968;&#25454;&#65292;&#31227;&#21160;&#21040;&#26368;&#21069;&#38754;&#12290;</span>
    c.ll.<span style="color: #bc6ec5; font-weight: bold;">MoveToFront</span><span style="color: #2d9574;">(</span>ele<span style="color: #2d9574;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> ele.Value.<span style="color: #2d9574;">(</span>*<span style="color: #ce537a; font-weight: bold;">entry</span><span style="color: #2d9574;">)</span>.value, <span style="color: #a45bad;">true</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
其他的一些操作都非常简单，不一一列出.
</p>
</div>
</div>
