org/groupcache.org
* cache结构
  groupcache中的cache主要是加了并发安全，并添加一些统计数据, 一些操作都是直接调用lru.cache
  #+BEGIN_SRC go
    type cache struct {
      mu         sync.RWMutex
      nbytes     int64 // of all keys and values
      lru        *lru.Cache
      nhit, nget int64
      nevict     int64 // number of evictions
    }

    func (c *cache) add(key string, value ByteView) {
      c.mu.Lock()
      defer c.mu.Unlock()
      if c.lru == nil {
        c.lru = &lru.Cache{
          OnEvicted: func(key lru.Key, value interface{}) {
            val := value.(ByteView)
            c.nbytes -= int64(len(key.(string))) + int64(val.Len())
            c.nevict++
          },
        }
      }
      c.lru.Add(key, value)
      c.nbytes += int64(len(key)) + int64(value.Len())
    }

    func (c *cache) get(key string) (value ByteView, ok bool) {
      c.mu.Lock()
      defer c.mu.Unlock()
      c.nget++
      if c.lru == nil {
        return
      }
      vi, ok := c.lru.Get(key)
      if !ok {
        return
      }
      c.nhit++
      return vi.(ByteView), true
    }
  #+END_SRC
