groupcache.html
<div id="outline-container-org86e0567" class="outline-2">
<h2 id="org86e0567"><span class="section-number-2">3</span> cache结构</h2>
<div class="outline-text-2" id="text-3">
<p>
groupcache中的cache主要是加了并发安全，并添加一些统计数据, 一些操作都是直接调用lru.cache
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">cache</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #4f97d7;">{</span>
  mu         sync.RWMutex
  nbytes     int64 <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">of all keys and values</span>
  lru        *lru.Cache
  nhit, nget int64
  nevict     int64 <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">number of evictions</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>c *<span style="color: #ce537a; font-weight: bold;">cache</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">add</span><span style="color: #4f97d7;">(</span>key <span style="color: #ce537a; font-weight: bold;">string</span>, value <span style="color: #ce537a; font-weight: bold;">ByteView</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  c.mu.<span style="color: #bc6ec5; font-weight: bold;">Lock</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #4f97d7; font-weight: bold;">defer</span> c.mu.<span style="color: #bc6ec5; font-weight: bold;">Unlock</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> c.lru == <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    c.lru = &amp;lru.<span style="color: #ce537a; font-weight: bold;">Cache</span><span style="color: #2d9574;">{</span>
      <span style="color: #a45bad;">OnEvicted</span>: <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #67b11d;">(</span>key <span style="color: #ce537a; font-weight: bold;">lru.Key</span>, value <span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #b1951d;">{}</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
        val := value.<span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">ByteView</span><span style="color: #b1951d;">)</span>
        c.nbytes -= <span style="color: #bc6ec5; font-weight: bold;">int64</span><span style="color: #b1951d;">(</span><span style="color: #4f97d7;">len</span><span style="color: #4f97d7;">(</span>key.<span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span> + <span style="color: #bc6ec5; font-weight: bold;">int64</span><span style="color: #b1951d;">(</span>val.<span style="color: #bc6ec5; font-weight: bold;">Len</span><span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span>
        c.nevict++
      <span style="color: #67b11d;">}</span>,
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
  c.lru.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #bc6ec5;">(</span>key, value<span style="color: #bc6ec5;">)</span>
  c.nbytes += <span style="color: #bc6ec5; font-weight: bold;">int64</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">len</span><span style="color: #2d9574;">(</span>key<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> + <span style="color: #bc6ec5; font-weight: bold;">int64</span><span style="color: #bc6ec5;">(</span>value.<span style="color: #bc6ec5; font-weight: bold;">Len</span><span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>c *<span style="color: #ce537a; font-weight: bold;">cache</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">get</span><span style="color: #4f97d7;">(</span>key <span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>value <span style="color: #ce537a; font-weight: bold;">ByteView</span>, ok <span style="color: #ce537a; font-weight: bold;">bool</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  c.mu.<span style="color: #bc6ec5; font-weight: bold;">Lock</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #4f97d7; font-weight: bold;">defer</span> c.mu.<span style="color: #bc6ec5; font-weight: bold;">Unlock</span><span style="color: #bc6ec5;">()</span>
  c.nget++
  <span style="color: #4f97d7; font-weight: bold;">if</span> c.lru == <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span>
  <span style="color: #bc6ec5;">}</span>
  vi, ok := c.lru.<span style="color: #bc6ec5; font-weight: bold;">Get</span><span style="color: #bc6ec5;">(</span>key<span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> !ok <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span>
  <span style="color: #bc6ec5;">}</span>
  c.nhit++
  <span style="color: #4f97d7; font-weight: bold;">return</span> vi.<span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">ByteView</span><span style="color: #bc6ec5;">)</span>, <span style="color: #a45bad;">true</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
