org/groupcache.org
* group结构
  group结构如下:
  #+BEGIN_SRC go
    type Group struct {
      //group的名字，必须唯一
      name       string
      //getter方法，用于从缓存失效后从数据库或其他地方获取数据.
      getter     Getter
      //分布式支持
      peersOnce  sync.Once
      peers      PeerPicker
      cacheBytes int64 // limit for sum of mainCache and hotCache size

      //两个缓存
      // mainCache is a cache of the keys for which this process
      // (amongst its peers) is authoritative. That is, this cache
      // contains keys which consistent hash on to this process's
      // peer number.
      mainCache cache

      // hotCache contains keys/values for which this peer is not
      // authoritative (otherwise they would be in mainCache), but
      // are popular enough to warrant mirroring in this process to
      // avoid going over the network to fetch from a peer.  Having
      // a hotCache avoids network hotspotting, where a peer's
      // network card could become the bottleneck on a popular key.
      // This cache is used sparingly to maximize the total number
      // of key/value pairs that can be stored globally.
      hotCache cache

      // loadGroup ensures that each key is only fetched once
      // (either locally or remotely), regardless of the number of
      // concurrent callers.
      // 在缓存命中失败的时候减少调用
      loadGroup flightGroup

      _ int32 // force Stats to be 8-byte aligned on 32-bit platforms

      // Stats are statistics on the group.
      Stats Stats
    }
  #+END_SRC
  先说flightGroup结构比较简单，这个结构主要是在缓存失效的时候，减少对底层的访问。比如一个缓存数据失效了，这个时候同时会有很多人调用接口，缓存都没有命中，就会对数据库发起很多次调用，其实这个时候只要调用一次就行了，其他的都是相同的数据。
  #+BEGIN_SRC go
    func (g *Group) Do(key string, fn func() (interface{}, error)) (interface{}, error) {
      g.mu.Lock()
      if g.m == nil {
        g.m = make(map[string]*call)
      }
      //对于同一个key的调用等待其他goroutine调用完成
      if c, ok := g.m[key]; ok {
        g.mu.Unlock()
        c.wg.Wait()
        //直接返回数据
        return c.val, c.err
      }
      //同个key的调用放在map中
      c := new(call)
      c.wg.Add(1)
      g.m[key] = c
      g.mu.Unlock()

      //获取数据
      c.val, c.err = fn()
      c.wg.Done()

      //删除限制
      g.mu.Lock()
      delete(g.m, key)
      g.mu.Unlock()

      return c.val, c.err
    }

  #+END_SRC
  来看看group的get方法是怎么使用的
  #+BEGIN_SRC go
    func (g *Group) Get(ctx Context, key string, dest Sink) error {
      g.peersOnce.Do(g.initPeers)
      g.Stats.Gets.Add(1)
      if dest == nil {
        return errors.New("groupcache: nil dest Sink")
      }
      //在缓存中查看key
      value, cacheHit := g.lookupCache(key)
      if cacheHit {
        g.Stats.CacheHits.Add(1)
        return setSinkView(dest, value)
      }

      // Optimization to avoid double unmarshalling or copying: keep
      // track of whether the dest was already populated. One caller
      // (if local) will set this; the losers will not. The common
      // case will likely be one caller.
      destPopulated := false
      //如果没有在缓存中找到数据，就从getter方法中load进来
      value, destPopulated, err := g.load(ctx, key, dest)
      if err != nil {
        return err
      }
      if destPopulated {
        return nil
      }
      return setSinkView(dest, value)
    }

    func (g *Group) lookupCache(key string) (value ByteView, ok bool) {
      //这个方法比较简单，从是从maincache和hotcache中读取数据
      if g.cacheBytes <= 0 {
        return
      }
      value, ok = g.mainCache.get(key)
      if ok {
        return
      }
      value, ok = g.hotCache.get(key)
      return
    }
    func (g *Group) load(ctx Context, key string, dest Sink) (value ByteView, destPopulated bool, err error) {
      g.Stats.Loads.Add(1)
      //loadGroup减少对底层的调用，上面已经说了
      viewi, err := g.loadGroup.Do(key, func() (interface{}, error) {
        if value, cacheHit := g.lookupCache(key); cacheHit {
          g.Stats.CacheHits.Add(1)
          return value, nil
        }
        g.Stats.LoadsDeduped.Add(1)
        var value ByteView
        var err error
        //如果能从远程获取，就从分布式的其他机子获取就从其他机子获取，因为其他机器也是缓存数据比数据库快
        if peer, ok := g.peers.PickPeer(key); ok {
          value, err = g.getFromPeer(ctx, peer, key)
          if err == nil {
            g.Stats.PeerLoads.Add(1)
            return value, nil
          }
          g.Stats.PeerErrors.Add(1)
          // TODO(bradfitz): log the peer's error? keep
          // log of the past few for /groupcachez?  It's
          // probably boring (normal task movement), so not
          // worth logging I imagine.
        }
        //调用getter方法，获取数据(从数据库，或者其他地方)
        value, err = g.getLocally(ctx, key, dest)
        if err != nil {
          g.Stats.LocalLoadErrs.Add(1)
          return nil, err
        }
        g.Stats.LocalLoads.Add(1)
        destPopulated = true // only one caller of load gets this return value
        //把数据存放在cache中
        g.populateCache(key, value, &g.mainCache)
        return value, nil
      })
      if err == nil {
        value = viewi.(ByteView)
      }
      return
    }
  #+END_SRC
