groupcache.html
<div id="outline-container-org7146199" class="outline-2">
<h2 id="org7146199"><span class="section-number-2">4</span> group结构</h2>
<div class="outline-text-2" id="text-4">
<p>
group结构如下:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Group</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">group&#30340;&#21517;&#23383;&#65292;&#24517;&#39035;&#21807;&#19968;</span>
  name       string
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">getter&#26041;&#27861;&#65292;&#29992;&#20110;&#20174;&#32531;&#23384;&#22833;&#25928;&#21518;&#20174;&#25968;&#25454;&#24211;&#25110;&#20854;&#20182;&#22320;&#26041;&#33719;&#21462;&#25968;&#25454;.</span>
  getter     Getter
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#20998;&#24067;&#24335;&#25903;&#25345;</span>
  peersOnce  sync.Once
  peers      PeerPicker
  cacheBytes int64 <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">limit for sum of mainCache and hotCache size</span>

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#20004;&#20010;&#32531;&#23384;</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">mainCache is a cache of the keys for which this process</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">(amongst its peers) is authoritative. That is, this cache</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">contains keys which consistent hash on to this process's</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">peer number.</span>
  mainCache cache

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">hotCache contains keys/values for which this peer is not</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">authoritative (otherwise they would be in mainCache), but</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">are popular enough to warrant mirroring in this process to</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">avoid going over the network to fetch from a peer.  Having</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">a hotCache avoids network hotspotting, where a peer's</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">network card could become the bottleneck on a popular key.</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">This cache is used sparingly to maximize the total number</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">of key/value pairs that can be stored globally.</span>
  hotCache cache

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">loadGroup ensures that each key is only fetched once</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">(either locally or remotely), regardless of the number of</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">concurrent callers.</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#32531;&#23384;&#21629;&#20013;&#22833;&#36133;&#30340;&#26102;&#20505;&#20943;&#23569;&#35843;&#29992;</span>
  loadGroup flightGroup

  _ int32 <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">force Stats to be 8-byte aligned on 32-bit platforms</span>

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Stats are statistics on the group.</span>
  Stats Stats
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
先说flightGroup结构比较简单，这个结构主要是在缓存失效的时候，减少对底层的访问。比如一个缓存数据失效了，这个时候同时会有很多人调用接口，缓存都没有命中，就会对数据库发起很多次调用，其实这个时候只要调用一次就行了，其他的都是相同的数据。
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>g *<span style="color: #ce537a; font-weight: bold;">Group</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">Do</span><span style="color: #4f97d7;">(</span>key <span style="color: #ce537a; font-weight: bold;">string</span>, fn <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #2d9574;">{}</span>, <span style="color: #ce537a; font-weight: bold;">error</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #bc6ec5;">{}</span>, <span style="color: #ce537a; font-weight: bold;">error</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  g.mu.<span style="color: #bc6ec5; font-weight: bold;">Lock</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> g.m == <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    g.m = <span style="color: #4f97d7;">make</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">map</span><span style="color: #67b11d;">[</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #67b11d;">]</span>*<span style="color: #ce537a; font-weight: bold;">call</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#23545;&#20110;&#21516;&#19968;&#20010;key&#30340;&#35843;&#29992;&#31561;&#24453;&#20854;&#20182;goroutine&#35843;&#29992;&#23436;&#25104;</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> c, ok := g.m<span style="color: #bc6ec5;">[</span>key<span style="color: #bc6ec5;">]</span>; ok <span style="color: #bc6ec5;">{</span>
    g.mu.<span style="color: #bc6ec5; font-weight: bold;">Unlock</span><span style="color: #2d9574;">()</span>
    c.wg.<span style="color: #bc6ec5; font-weight: bold;">Wait</span><span style="color: #2d9574;">()</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#30452;&#25509;&#36820;&#22238;&#25968;&#25454;</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> c.val, c.err
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#21516;&#20010;key&#30340;&#35843;&#29992;&#25918;&#22312;map&#20013;</span>
  c := <span style="color: #4f97d7;">new</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">call</span><span style="color: #bc6ec5;">)</span>
  c.wg.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>
  g.m<span style="color: #bc6ec5;">[</span>key<span style="color: #bc6ec5;">]</span> = c
  g.mu.<span style="color: #bc6ec5; font-weight: bold;">Unlock</span><span style="color: #bc6ec5;">()</span>

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#33719;&#21462;&#25968;&#25454;</span>
  c.val, c.err = <span style="color: #bc6ec5; font-weight: bold;">fn</span><span style="color: #bc6ec5;">()</span>
  c.wg.<span style="color: #bc6ec5; font-weight: bold;">Done</span><span style="color: #bc6ec5;">()</span>

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#21024;&#38500;&#38480;&#21046;</span>
  g.mu.<span style="color: #bc6ec5; font-weight: bold;">Lock</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #4f97d7;">delete</span><span style="color: #bc6ec5;">(</span>g.m, key<span style="color: #bc6ec5;">)</span>
  g.mu.<span style="color: #bc6ec5; font-weight: bold;">Unlock</span><span style="color: #bc6ec5;">()</span>

  <span style="color: #4f97d7; font-weight: bold;">return</span> c.val, c.err
<span style="color: #4f97d7;">}</span>

</pre>
</div>
<p>
来看看group的get方法是怎么使用的
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>g *<span style="color: #ce537a; font-weight: bold;">Group</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">Get</span><span style="color: #4f97d7;">(</span>ctx <span style="color: #ce537a; font-weight: bold;">Context</span>, key <span style="color: #ce537a; font-weight: bold;">string</span>, dest <span style="color: #ce537a; font-weight: bold;">Sink</span><span style="color: #4f97d7;">)</span> <span style="color: #ce537a; font-weight: bold;">error</span> <span style="color: #4f97d7;">{</span>
  g.peersOnce.<span style="color: #bc6ec5; font-weight: bold;">Do</span><span style="color: #bc6ec5;">(</span>g.initPeers<span style="color: #bc6ec5;">)</span>
  g.Stats.Gets.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> dest == <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> errors.<span style="color: #bc6ec5; font-weight: bold;">New</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"groupcache: nil dest Sink"</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#32531;&#23384;&#20013;&#26597;&#30475;key</span>
  value, cacheHit := g.<span style="color: #bc6ec5; font-weight: bold;">lookupCache</span><span style="color: #bc6ec5;">(</span>key<span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> cacheHit <span style="color: #bc6ec5;">{</span>
    g.Stats.CacheHits.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">setSinkView</span><span style="color: #2d9574;">(</span>dest, value<span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Optimization to avoid double unmarshalling or copying: keep</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">track of whether the dest was already populated. One caller</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">(if local) will set this; the losers will not. The common</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">case will likely be one caller.</span>
  destPopulated := <span style="color: #a45bad;">false</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#27809;&#26377;&#22312;&#32531;&#23384;&#20013;&#25214;&#21040;&#25968;&#25454;&#65292;&#23601;&#20174;getter&#26041;&#27861;&#20013;load&#36827;&#26469;</span>
  value, destPopulated, err := g.<span style="color: #bc6ec5; font-weight: bold;">load</span><span style="color: #bc6ec5;">(</span>ctx, key, dest<span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> err != <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> err
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> destPopulated <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">nil</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5; font-weight: bold;">setSinkView</span><span style="color: #bc6ec5;">(</span>dest, value<span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>g *<span style="color: #ce537a; font-weight: bold;">Group</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">lookupCache</span><span style="color: #4f97d7;">(</span>key <span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>value <span style="color: #ce537a; font-weight: bold;">ByteView</span>, ok <span style="color: #ce537a; font-weight: bold;">bool</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#20010;&#26041;&#27861;&#27604;&#36739;&#31616;&#21333;&#65292;&#20174;&#26159;&#20174;maincache&#21644;hotcache&#20013;&#35835;&#21462;&#25968;&#25454;</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> g.cacheBytes &lt;= <span style="color: #a45bad;">0</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span>
  <span style="color: #bc6ec5;">}</span>
  value, ok = g.mainCache.<span style="color: #bc6ec5; font-weight: bold;">get</span><span style="color: #bc6ec5;">(</span>key<span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> ok <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span>
  <span style="color: #bc6ec5;">}</span>
  value, ok = g.hotCache.<span style="color: #bc6ec5; font-weight: bold;">get</span><span style="color: #bc6ec5;">(</span>key<span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span>
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>g *<span style="color: #ce537a; font-weight: bold;">Group</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">load</span><span style="color: #4f97d7;">(</span>ctx <span style="color: #ce537a; font-weight: bold;">Context</span>, key <span style="color: #ce537a; font-weight: bold;">string</span>, dest <span style="color: #ce537a; font-weight: bold;">Sink</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>value <span style="color: #ce537a; font-weight: bold;">ByteView</span>, destPopulated <span style="color: #ce537a; font-weight: bold;">bool</span>, err <span style="color: #ce537a; font-weight: bold;">error</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  g.Stats.Loads.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">loadGroup&#20943;&#23569;&#23545;&#24213;&#23618;&#30340;&#35843;&#29992;&#65292;&#19978;&#38754;&#24050;&#32463;&#35828;&#20102;</span>
  viewi, err := g.loadGroup.<span style="color: #bc6ec5; font-weight: bold;">Do</span><span style="color: #bc6ec5;">(</span>key, <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #2d9574;">()</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">interface</span><span style="color: #67b11d;">{}</span>, <span style="color: #ce537a; font-weight: bold;">error</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> value, cacheHit := g.<span style="color: #bc6ec5; font-weight: bold;">lookupCache</span><span style="color: #67b11d;">(</span>key<span style="color: #67b11d;">)</span>; cacheHit <span style="color: #67b11d;">{</span>
      g.Stats.CacheHits.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #b1951d;">(</span><span style="color: #a45bad;">1</span><span style="color: #b1951d;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> value, <span style="color: #a45bad;">nil</span>
    <span style="color: #67b11d;">}</span>
    g.Stats.LoadsDeduped.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #67b11d;">(</span><span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">var</span> value ByteView
    <span style="color: #4f97d7; font-weight: bold;">var</span> err error
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#33021;&#20174;&#36828;&#31243;&#33719;&#21462;&#65292;&#23601;&#20174;&#20998;&#24067;&#24335;&#30340;&#20854;&#20182;&#26426;&#23376;&#33719;&#21462;&#23601;&#20174;&#20854;&#20182;&#26426;&#23376;&#33719;&#21462;&#65292;&#22240;&#20026;&#20854;&#20182;&#26426;&#22120;&#20063;&#26159;&#32531;&#23384;&#25968;&#25454;&#27604;&#25968;&#25454;&#24211;&#24555;</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> peer, ok := g.peers.<span style="color: #bc6ec5; font-weight: bold;">PickPeer</span><span style="color: #67b11d;">(</span>key<span style="color: #67b11d;">)</span>; ok <span style="color: #67b11d;">{</span>
      value, err = g.<span style="color: #bc6ec5; font-weight: bold;">getFromPeer</span><span style="color: #b1951d;">(</span>ctx, peer, key<span style="color: #b1951d;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> err == <span style="color: #a45bad;">nil</span> <span style="color: #b1951d;">{</span>
        g.Stats.PeerLoads.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> value, <span style="color: #a45bad;">nil</span>
      <span style="color: #b1951d;">}</span>
      g.Stats.PeerErrors.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #b1951d;">(</span><span style="color: #a45bad;">1</span><span style="color: #b1951d;">)</span>
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #cc9393;">TODO</span><span style="color: #2aa1ae; background-color: #292e34;">(bradfitz): log the peer's error? keep</span>
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">log of the past few for /groupcachez?  It's</span>
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">probably boring (normal task movement), so not</span>
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">worth logging I imagine.</span>
    <span style="color: #67b11d;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;getter&#26041;&#27861;&#65292;&#33719;&#21462;&#25968;&#25454;(&#20174;&#25968;&#25454;&#24211;&#65292;&#25110;&#32773;&#20854;&#20182;&#22320;&#26041;)</span>
    value, err = g.<span style="color: #bc6ec5; font-weight: bold;">getLocally</span><span style="color: #67b11d;">(</span>ctx, key, dest<span style="color: #67b11d;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> err != <span style="color: #a45bad;">nil</span> <span style="color: #67b11d;">{</span>
      g.Stats.LocalLoadErrs.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #b1951d;">(</span><span style="color: #a45bad;">1</span><span style="color: #b1951d;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">nil</span>, err
    <span style="color: #67b11d;">}</span>
    g.Stats.LocalLoads.<span style="color: #bc6ec5; font-weight: bold;">Add</span><span style="color: #67b11d;">(</span><span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span>
    destPopulated = <span style="color: #a45bad;">true</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">only one caller of load gets this return value</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#25226;&#25968;&#25454;&#23384;&#25918;&#22312;cache&#20013;</span>
    g.<span style="color: #bc6ec5; font-weight: bold;">populateCache</span><span style="color: #67b11d;">(</span>key, value, &amp;g.mainCache<span style="color: #67b11d;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> value, <span style="color: #a45bad;">nil</span>
  <span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> err == <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    value = viewi.<span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">ByteView</span><span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
