org/groupcache.org
* 分布式结构
  上面提到了从分布式机子获取缓存使用的是getFromPeer方法,下面是源码
  #+BEGIN_SRC go
    //每一个分布式的服务都需要实现一个Get方法，接口描述文件在proto文件中
    func (g *Group) getFromPeer(ctx Context, peer ProtoGetter, key string) (ByteView, error) {
      req := &pb.GetRequest{
        Group: &g.name,
        Key:   &key,
      }
      res := &pb.GetResponse{}
      //从远端得到数据
      err := peer.Get(ctx, req, res)
      if err != nil {
        return ByteView{}, err
      }
      value := ByteView{b: res.Value}
      // TODO(bradfitz): use res.MinuteQps or something smart to
      // conditionally populate hotCache.  For now just do it some
      // percentage of the time.
      //哈哈，这里随机放在hotCache中,有意思
      if rand.Intn(10) == 0 {
        g.populateCache(key, value, &g.hotCache)
      }
      return value, nil
    }
  #+END_SRC
  然后groupcache实现了一个Get接口，源码在http.go中, 有兴趣的可以看看。这里就不加了。

* 总结
  所以现在可以看到一次groupcache的读取过程如下:
  1. 从mainCache中读取
  2. 从hotCache中读取
  3. 从分布式集群中的其他机器读取
  4. 从底层(数据库或其他地方)读取
  
  不过groupcache只支持get方法，你不能自己控制cache过期。这点不大方便，因为我们总希望实时获取数据。
