groupcache.html
<div id="outline-container-orgfa48ad7" class="outline-2">
<h2 id="orgfa48ad7"><span class="section-number-2">5</span> 分布式结构</h2>
<div class="outline-text-2" id="text-5">
<p>
上面提到了从分布式机子获取缓存使用的是getFromPeer方法,下面是源码
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#27599;&#19968;&#20010;&#20998;&#24067;&#24335;&#30340;&#26381;&#21153;&#37117;&#38656;&#35201;&#23454;&#29616;&#19968;&#20010;Get&#26041;&#27861;&#65292;&#25509;&#21475;&#25551;&#36848;&#25991;&#20214;&#22312;proto&#25991;&#20214;&#20013;</span>
<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #4f97d7;">(</span>g *<span style="color: #ce537a; font-weight: bold;">Group</span><span style="color: #4f97d7;">)</span> <span style="color: #bc6ec5; font-weight: bold;">getFromPeer</span><span style="color: #4f97d7;">(</span>ctx <span style="color: #ce537a; font-weight: bold;">Context</span>, peer <span style="color: #ce537a; font-weight: bold;">ProtoGetter</span>, key <span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ByteView</span>, <span style="color: #ce537a; font-weight: bold;">error</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  req := &amp;pb.<span style="color: #ce537a; font-weight: bold;">GetRequest</span><span style="color: #bc6ec5;">{</span>
    <span style="color: #a45bad;">Group</span>: &amp;g.name,
    <span style="color: #a45bad;">Key</span>:   &amp;key,
  <span style="color: #bc6ec5;">}</span>
  res := &amp;pb.<span style="color: #ce537a; font-weight: bold;">GetResponse</span><span style="color: #bc6ec5;">{}</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#20174;&#36828;&#31471;&#24471;&#21040;&#25968;&#25454;</span>
  err := peer.<span style="color: #bc6ec5; font-weight: bold;">Get</span><span style="color: #bc6ec5;">(</span>ctx, req, res<span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> err != <span style="color: #a45bad;">nil</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #ce537a; font-weight: bold;">ByteView</span><span style="color: #2d9574;">{}</span>, err
  <span style="color: #bc6ec5;">}</span>
  value := <span style="color: #ce537a; font-weight: bold;">ByteView</span><span style="color: #bc6ec5;">{</span>b: res.Value<span style="color: #bc6ec5;">}</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #cc9393;">TODO</span><span style="color: #2aa1ae; background-color: #292e34;">(bradfitz): use res.MinuteQps or something smart to</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">conditionally populate hotCache.  For now just do it some</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">percentage of the time.</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#21704;&#21704;&#65292;&#36825;&#37324;&#38543;&#26426;&#25918;&#22312;hotCache&#20013;,&#26377;&#24847;&#24605;</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> rand.<span style="color: #bc6ec5; font-weight: bold;">Intn</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">10</span><span style="color: #bc6ec5;">)</span> == <span style="color: #a45bad;">0</span> <span style="color: #bc6ec5;">{</span>
    g.<span style="color: #bc6ec5; font-weight: bold;">populateCache</span><span style="color: #2d9574;">(</span>key, value, &amp;g.hotCache<span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> value, <span style="color: #a45bad;">nil</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
然后groupcache实现了一个Get接口，源码在http.go中, 有兴趣的可以看看。这里就不加了。
</p>
</div>
</div>

<div id="outline-container-org99cf417" class="outline-2">
<h2 id="org99cf417"><span class="section-number-2">6</span> 总结</h2>
<div class="outline-text-2" id="text-6">
<p>
所以现在可以看到一次groupcache的读取过程如下:
</p>
<ol class="org-ol">
<li>从mainCache中读取</li>
<li>从hotCache中读取</li>
<li>从分布式集群中的其他机器读取</li>
<li>从底层(数据库或其他地方)读取</li>
</ol>

<p>
不过groupcache只支持get方法，你不能自己控制cache过期。这点不大方便，因为我们总希望实时获取数据。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-10 Sat 13:17</p>
<p class="validation"></p>
</div>
</body>
</html>
